{
  "Science and Openness": {
      "highest_STEAM": "Science",
      "highest_OCEAN": "Openness",
      "environment": "exploratory and innovative",
      "thrive": "curiosity and creativity",
      "feedback": "Your affinity for science combined with an open-minded approach suggests you'd excel in exploratory and innovative environments. Your curiosity and creativity will drive you forward in fields that value research and development. Consider careers in cutting-edge research labs, or innovative sectors like biotechnology or renewable energy."
  },
  "Science and Conscientiousness": {
      "highest_STEAM": "Science",
      "highest_OCEAN": "Conscientiousness",
      "environment": "structured and analytical",
      "thrive": "precision and methodical work",
      "feedback": "Based on your test results, it seems that you might be best suited to a structured and analytical environment. You'll thrive in a setting that values precision and methodical work. A career in a research laboratory or a quality assurance role in a manufacturing company could be excellent choices for you."
  },
  "Science and Extraversion": {
      "highest_STEAM": "Science",
      "highest_OCEAN": "Extraversion",
      "environment": "collaborative and dynamic",
      "thrive": "teamwork and communication",
      "feedback": "Your scientific aptitude paired with an extroverted nature could see you flourishing in collaborative and dynamic environments. Your ability for teamwork and communication will serve you well in roles that require collective effort and public engagement. Careers in science education, science communication, or leading research teams could be very rewarding."
  },
  "Science and Agreeableness": {
      "highest_STEAM": "Science",
      "highest_OCEAN": "Agreeableness",
      "environment": "supportive and cooperative",
      "thrive": "empathy and interpersonal skills",
      "feedback": "Your scientific interests, along with your agreeable nature, may find a harmonious match in supportive and cooperative environments. Your empathy and interpersonal skills could shine in roles that require understanding and aiding others. Consider careers in medical science, counseling, or non-profit organizations focused on scientific education and outreach."
  },
  "Science and Neuroticism": {
      "highest_STEAM": "Science",
      "highest_OCEAN": "Neuroticism",
      "environment": "predictable and stable",
      "thrive": "attention to detail and thorough analysis",
      "feedback": "With a keen sense for science and a tendency towards thorough analysis, you may find comfort in predictable and stable environments. Your attention to detail could be a valuable asset in fields that require meticulous observation and analysis. Roles in clinical research, data analysis, or quality control in scientific manufacturing may suit you well."
  },
  "Technology and Openness": {
      "highest_STEAM": "Technology",
      "highest_OCEAN": "Openness",
      "environment": "innovative and exploratory",
      "thrive": "creativity and problem-solving",
      "feedback": "With your penchant for technology and a mindset open to new experiences, you're likely to excel in innovative and exploratory environments. Your creativity and problem-solving abilities will be your greatest assets. Roles in software development, UX/UI design, or a start-up environment might be very fulfilling for you."
  },
  "Technology and Conscientiousness": {
      "highest_STEAM": "Technology",
      "highest_OCEAN": "Conscientiousness",
      "environment": "structured and data-driven",
      "thrive": "precision and organized workflow",
      "feedback": "Your technological aptitude combined with a conscientious nature suggests a structured and data-driven environment would suit you well. Your precision and ability to maintain an organized workflow will be highly valued in roles such as database administration, systems analysis, or project management in tech-oriented companies."
  },
  "Technology and Extraversion": {
      "highest_STEAM": "Technology",
      "highest_OCEAN": "Extraversion",
      "environment": "collaborative and interactive",
      "thrive": "teamwork and communication",
      "feedback": "Your tech-savviness paired with an extroverted personality could flourish in collaborative and interactive environments. Your teamwork and communication skills could lead to success in roles like IT project management, customer relations in tech companies, or sales and marketing in the tech sector."
  },
  "Technology and Agreeableness": {
      "highest_STEAM": "Technology",
      "highest_OCEAN": "Agreeableness",
      "environment": "supportive and user-centric",
      "thrive": "empathy and understanding user needs",
      "feedback": "Your technological prowess along with an agreeable nature align well with supportive and user-centric environments. Your empathy and ability to understand user needs would be crucial in roles such as user experience design, customer support in tech firms, or working in tech for social good initiatives."
  },
  "Technology and Neuroticism": {
      "highest_STEAM": "Technology",
      "highest_OCEAN": "Neuroticism",
      "environment": "predictable and well-defined",
      "thrive": "attention to detail and thorough analysis",
      "feedback": "Your technological inclination and meticulous nature may find a match in predictable and well-defined environments. Your attention to detail and thorough analysis could be well utilized in roles like quality assurance testing, cybersecurity, or network administration where precision is paramount."
  },
  "English and Openness": {
      "highest_STEAM": "English",
      "highest_OCEAN": "Openness",
      "environment": "creative and exploratory",
      "thrive": "imagination and expression",
      "feedback": "Your affinity for English and openness to new experiences suggests a creative and exploratory environment would suit you well. Your imagination and expressive abilities would flourish in fields such as creative writing, journalism, or editorial roles in publishing."
  },
  "English and Conscientiousness": {
      "highest_STEAM": "English",
      "highest_OCEAN": "Conscientiousness",
      "environment": "structured and detail-oriented",
      "thrive": "precision and organized thought",
      "feedback": "With a strong background in English and a conscientious nature, you would thrive in a structured and detail-oriented environment. Your precision and ability for organized thought could lead to success in roles like editing, academic research, or administrative positions in literary organizations."
  },
  "English and Extraversion": {
      "highest_STEAM": "English",
      "highest_OCEAN": "Extraversion",
      "environment": "interactive and collaborative",
      "thrive": "communication and team dynamics",
      "feedback": "Your English expertise combined with an extroverted personality makes an interactive and collaborative environment ideal for you. Your communication skills and ability to work well in team dynamics could be utilized in careers like public relations, literary event coordination, or teaching."
  },
  "English and Agreeableness": {
      "highest_STEAM": "English",
      "highest_OCEAN": "Agreeableness",
      "environment": "supportive and cooperative",
      "thrive": "empathy and understanding",
      "feedback": "Your English background and agreeable nature align well with supportive and cooperative environments. Your empathy and understanding could be instrumental in roles such as counseling, social work with a focus on literacy, or community outreach in cultural organizations."
  },
  "English and Neuroticism": {
      "highest_STEAM": "English",
      "highest_OCEAN": "Neuroticism",
      "environment": "stable and well-defined",
      "thrive": "meticulous analysis and thoughtful expression",
      "feedback": "With your strong English foundation and meticulous nature, you might find comfort in stable and well-defined environments. Your aptitude for meticulous analysis and thoughtful expression could serve you well in roles like copyediting, archival work, or legal research in the realm of literary law."
  },
  "Art and Openness": {
      "highest_STEAM": "Art",
      "highest_OCEAN": "Openness",
      "environment": "innovative and free-form",
      "thrive": "creativity and experimentation",
      "feedback": "Your artistic skills paired with an open-minded approach flourish in innovative and free-form environments. Your creativity and willingness to experiment are your strongest assets, potentially leading to a fulfilling career in contemporary art, design, or other creative industries."
  },
  "Art and Conscientiousness": {
      "highest_STEAM": "Art",
      "highest_OCEAN": "Conscientiousness",
      "environment": "structured and meticulous",
      "thrive": "precision and attention to detail",
      "feedback": "With your artistic aptitude and conscientious nature, a structured and meticulous environment could suit you well. Your precision and attention to detail would be valued in fields like graphic design, illustration, or a role that involves curating art exhibitions."
  },
  "Art and Extraversion": {
      "highest_STEAM": "Art",
      "highest_OCEAN": "Extraversion",
      "environment": "collaborative and engaging",
      "thrive": "interaction and teamwork",
      "feedback": "Your artistic flair combined with an extroverted personality could thrive in collaborative and engaging environments. Your ability for interaction and teamwork could serve you well in roles such as art education, community art projects, or working in a collaborative studio setting."
  },
  "Art and Agreeableness": {
      "highest_STEAM": "Art",
      "highest_OCEAN": "Agreeableness",
      "environment": "supportive and community-focused",
      "thrive": "empathy and collaboration",
      "feedback": "Your artistic interests, paired with an agreeable nature, align well with supportive and community-focused environments. Your empathy and ability to collaborate could shine in roles that involve community art projects, therapeutic art practices, or working in inclusive and diverse creative spaces."
  },
  "Art and Neuroticism": {
      "highest_STEAM": "Art",
      "highest_OCEAN": "Neuroticism",
      "environment": "calm and well-defined",
      "thrive": "deep reflection and expressive outlets",
      "feedback": "With an artistic mindset and a reflective nature, you may find solace in calm and well-defined environments. Your ability for deep reflection and seeking expressive outlets could lead to a rewarding career in fields like fine arts, illustration, or expressive art therapy."
  },
  "Maths and Openness": {
      "highest_STEAM": "Maths",
      "highest_OCEAN": "Openness",
      "environment": "exploratory and innovative",
      "thrive": "problem-solving and creativity",
      "feedback": "Your mathematical aptitude, combined with an openness to new experiences, would flourish in exploratory and innovative environments. Your problem-solving skills and creativity could lead to success in fields like theoretical research, statistical analysis, or data-driven tech startups."
  },
  "Maths and Conscientiousness": {
      "highest_STEAM": "Maths",
      "highest_OCEAN": "Conscientiousness",
      "environment": "structured and analytical",
      "thrive": "precision and methodical work",
      "feedback": "With a strong foundation in maths and a conscientious nature, a structured and analytical environment could suit you well. Your precision and methodical approach to work would be valued in fields like actuarial science, accounting, or operations research."
  },
  "Maths and Extraversion": {
      "highest_STEAM": "Maths",
      "highest_OCEAN": "Extraversion",
      "environment": "collaborative and dynamic",
      "thrive": "communication and teamwork",
      "feedback": "Your mathematical skills paired with an extroverted personality could thrive in collaborative and dynamic environments. Your communication skills and ability to work well in teams could lead to fulfilling roles in education, consulting, or management positions in math-oriented industries."
  },
  "Maths and Agreeableness": {
      "highest_STEAM": "Maths",
      "highest_OCEAN": "Agreeableness",
      "environment": "supportive and cooperative",
      "thrive": "empathy and interpersonal skills",
      "feedback": "Your mathematical expertise along with an agreeable nature align well with supportive and cooperative environments. Your empathy and interpersonal skills could shine in roles such as statistical consulting for non-profits, education, or collaborative research projects."
  },
  "Maths and Neuroticism": {
      "highest_STEAM": "Maths",
      "highest_OCEAN": "Neuroticism",
      "environment": "predictable and well-defined",
      "thrive": "meticulous analysis and problem-solving",
      "feedback": "With a solid background in maths and a meticulous nature, you may find comfort in predictable and well-defined environments. Your ability for meticulous analysis and problem-solving could serve you well in roles like data analysis, financial planning, or risk management."
  }
}
